W6D4/first_routes_and_controllers/app/controllers/artwork_shares_controller.rb

    def destroy
        share = ArtworkShare.find(params[:id])
        share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]