W6D4/first_routes_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = $1  [["artist_id", 3]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def index
      # artwork = Artwork.all
      # render json: artwork
      # if params[:user_id]
      #   render json: Artwork.user_id_artworks(params[:user_id])
      #   render json: Artwork.shared_artworks(params[:user_id])
      # end
      artworks = Artwork.where(artist_id: params[:user_id])
      artworks += User.find(params[:user_id]).shared_artworks