W6D4/first_routes_and_controllers/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 2], ["artwork_id", 2], ["body", "'Amazing!!!!'"], ["created_at", "2020-05-14 23:06:28.132478"], ["updated_at", "2020-05-14 23:06:28.132478"]]

    def index
        if params[:user_id]
            comments = Comment.where(user_id: params[:user_id])
        elsif params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])
        else
            comments = Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 2]]
SELECT "comments".* FROM "comments"